# Задача 22: Даны два неупорядоченных набора целых чисел (может быть, с повторениями).
# Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах.
# Пользователь вводит 2 числа. n — кол-во элементов первого множества. m — кол-во элементов второго множества.
# Затем пользователь вводит сами элементы множеств.

# 11 6
# 2 4 6 8 10 12 10 8 6 4 2
# 3 6 9 12 15 18
# 6 12

n_a = int(input('Введите размер массива А: '))
n_b = int(input('Введите размер массива B: '))
a = [int(input(
    f'введите {i+1} элемент массива А: ')) for i in range(n_a)]
b = [int(n_b) for n_b in input(
    f'введите {n_b} элементов массива А через пробел: ').split()]

# a = [2, 4, 6, 8, 10, 12, 10, 8, 6, 4, 2]
# b = [3, 6, 9, 12, 15, 18]
print(sorted(list(set(a) & set(b))))
